
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 40 to add, 4 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-DATABASE-v16
  * azurerm_key_vault_secret.POSTGRES-HOST-v16
  * azurerm_key_vault_secret.POSTGRES-PASS-v16
  * azurerm_key_vault_secret.POSTGRES-USER-v16
  * azurerm_key_vault_secret.POSTGRES_PORT-v16
  * module.db-rd-location-ref-api.azurerm_postgresql_active_directory_administrator.admin
  * module.db-rd-location-ref-api.azurerm_postgresql_server.replica[&#34;replica&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-aks&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-ase&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-bastion-nonprod-vnet&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-cftaks-tf-aks00&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-cftaks-tf-aks01&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-idam-aat2-vnet&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-jenkins-aks&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-jenkins-aks-agent&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-shared-services-dev-aks00&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-shared-services-dev-aks01&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-shared-services-stg-aks00&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-shared-services-stg-aks01&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-shared-services-test-aks00&#34;]
  * module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules[&#34;replica-shared-services-test-aks01&#34;]
  * module.db-rd-location-ref-api.azurerm_resource_group.data-resourcegroup
  * module.db-rd-location-ref-api.azurerm_template_deployment.postgres-paas
  * module.db-rd-location-ref-api.null_resource.set-user-permissions[0]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[0]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[1]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[2]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[3]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[4]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[5]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[6]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[7]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[8]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[9]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[10]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[11]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[12]
  * module.db-rd-location-ref-api.null_resource.subnet_mappings[13]
  * module.db-rd-location-ref-api.random_string.password
* Update
  * azurerm_key_vault_secret.POSTGRES-HOST
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * module.db-rd-location-ref-api-v16.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
* Delete
  * module.db-rd-location-ref-api-v16.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
* Replace
  * module.db-rd-location-ref-api-v16.null_resource.set-user-permissions-additionaldbs[&#34;dbrdlocationref&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-DATABASE-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-DATABASE-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "location-ref-api-POSTGRES-DATABASE-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-HOST" {
        id                      = "https://rd-aat.vault.azure.net/secrets/location-ref-api-POSTGRES-HOST/4aac5057191841b4af456f528685e56f"
        name                    = "location-ref-api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-HOST-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-HOST-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "location-ref-api-POSTGRES-HOST-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - content_type            = "" -> null
        id                      = "https://rd-aat.vault.azure.net/secrets/location-ref-api-POSTGRES-PASS/a762b7a3ac804ce5ae440ea524730cee"
        name                    = "location-ref-api-POSTGRES-PASS"
        tags                    = {}
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "location-ref-api-POSTGRES-PASS-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://rd-aat.vault.azure.net/secrets/location-ref-api-POSTGRES-USER/b115c2ff760848d0947191b7eb59e268"
        name                    = "location-ref-api-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "location-ref-api-POSTGRES-USER-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT-v16 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT-v16" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat"
      + name                    = "location-ref-api-POSTGRES-PORT-v16"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.db-rd-location-ref-api.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "rd-location-ref-api-postgres-db-aat"
      + resource_group_name = "rd-location-ref-api-postgres-db-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations"
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "rd-location-ref-api-postgres-db-data-aat"
      + server_name         = "rd-location-ref-api-postgres-db-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_server.replica["replica"] will be created
  + resource "azurerm_postgresql_server" "replica" {
      + administrator_login              = "dbrdlocationref"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 35
      + create_mode                      = "Replica"
      + creation_source_server_id        = (known after apply)
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = true
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "rd-location-ref-api-postgres-db-aat-replica"
      + public_network_access_enabled    = true
      + resource_group_name              = "rd-location-ref-api-postgres-db-data-aat"
      + sku_name                         = "GP_Gen5_2"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 51200
      + tags                             = {
          + "application"         = "reference-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-location-ref-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "staging"
          + "managedBy"           = "Reference Data"
        }
      + version                          = "11"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-aks"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-aks"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-ase"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-ase"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-bastion-nonprod-vnet"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-bastion-nonprod-vnet"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-cftaks-tf-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-cftaks-tf-aks00"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-cftaks-tf-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-cftaks-tf-aks01"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-idam-aat2-vnet"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-idam-aat2-vnet"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-jenkins-aks"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-jenkins-aks"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-jenkins-aks-agent"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-jenkins-aks-agent"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-shared-services-dev-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-shared-services-dev-aks00"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-shared-services-dev-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-shared-services-dev-aks01"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-shared-services-stg-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-shared-services-stg-aks00"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-shared-services-stg-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-shared-services-stg-aks01"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-shared-services-test-aks00"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-shared-services-test-aks00"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
    }

  # module.db-rd-location-ref-api.azurerm_postgresql_virtual_network_rule.replica_rules["replica-shared-services-test-aks01"] will be created
  + resource "azurerm_postgresql_virtual_network_rule" "replica_rules" {
      + id                                   = (known after apply)
      + ignore_missing_vnet_service_endpoint = true
      + name                                 = "replica-shared-services-test-aks01"
      + resource_group_name                  = "rd-location-ref-api-postgres-db-data-aat"
      + server_name                          = "rd-location-ref-api-postgres-db-aat-replica"
      + subnet_id                            = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
    }

  # module.db-rd-location-ref-api.azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rd-location-ref-api-postgres-db-data-aat"
      + tags     = {
          + "application"         = "reference-data"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rd-location-ref-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          + "environment"         = "staging"
          + "managedBy"           = "Reference Data"
        }
    }

  # module.db-rd-location-ref-api.azurerm_template_deployment.postgres-paas will be created
  + resource "azurerm_template_deployment" "postgres-paas" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "rd-location-ref-api-postgres-db-aat"
      + outputs             = (known after apply)
      + parameters          = (known after apply)
      + resource_group_name = "rd-location-ref-api-postgres-db-data-aat"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + administratorLogin         = {
                      + maxLength = 16
                      + minLength = 1
                      + type      = "string"
                    }
                  + administratorLoginPassword = {
                      + type = "securestring"
                    }
                  + backupRetentionDays        = {
                      + defaultValue = 7
                      + type         = "string"
                    }
                  + charset                    = {
                      + type = "string"
                    }
                  + collation                  = {
                      + type = "string"
                    }
                  + commonTags                 = {
                      + type = "string"
                    }
                  + dbName                     = {
                      + type = "string"
                    }
                  + dbRules                    = {
                      + type = "string"
                    }
                  + env                        = {
                      + metadata = {
                          + description = "The tag"
                        }
                      + type     = "string"
                    }
                  + geoRedundantBackup         = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + location                   = {
                      + allowedValues = [
                          + "UK West",
                          + "ukwest",
                          + "UK South",
                          + "uksouth",
                        ]
                      + defaultValue  = "UK South"
                      + type          = "string"
                    }
                  + serverName                 = {
                      + maxLength = 63
                      + minLength = 2
                      + type      = "string"
                    }
                  + skuCapacity                = {
                      + defaultValue = 2
                      + type         = "string"
                    }
                  + skuFamily                  = {
                      + allowedValues = [
                          + "Gen5",
                        ]
                      + defaultValue  = "Gen5"
                      + type          = "string"
                    }
                  + skuName                    = {
                      + allowedValues = [
                          + "B_Gen5_1",
                          + "B_Gen5_2",
                          + "GP_Gen5_2",
                          + "GP_Gen5_4",
                          + "GP_Gen5_8",
                          + "GP_Gen5_16",
                          + "GP_Gen5_32",
                          + "MO_Gen5_2",
                          + "MO_Gen5_4",
                          + "MO_Gen5_8",
                          + "MO_Gen5_16",
                          + "MO_Gen5_32",
                        ]
                      + defaultValue  = "GP_Gen5_2"
                      + type          = "string"
                    }
                  + skuSizeMB                  = {
                      + defaultValue = "51200"
                      + type         = "string"
                    }
                  + skuTier                    = {
                      + allowedValues = [
                          + "Basic",
                          + "GeneralPurpose",
                          + "MemoryOptimized",
                        ]
                      + defaultValue  = "GeneralPurpose"
                      + type          = "string"
                    }
                  + sslEnforcement             = {
                      + defaultValue = "Enabled"
                      + type         = "string"
                    }
                  + version                    = {
                      + allowedValues = [
                          + "9.5",
                          + "9.6",
                          + "10",
                          + "11",
                        ]
                      + defaultValue  = "9.6"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + kind       = ""
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('serverName')]"
                      + properties = {
                          + administratorLogin         = "[parameters('administratorLogin')]"
                          + administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          + sslEnforcement             = "[parameters('sslEnforcement')]"
                          + storageProfile             = {
                              + backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              + geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              + storageMB           = "[parameters('skuSizeMB')]"
                            }
                          + version                    = "[parameters('version')]"
                        }
                      + resources  = [
                          + {
                              + apiVersion = "2017-12-01-preview"
                              + dependsOn  = [
                                  + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              + name       = "[parameters('dbName')]"
                              + properties = {
                                  + charset   = "[parameters('charset')]"
                                  + collation = "[parameters('collation')]"
                                }
                              + type       = "databases"
                            },
                        ]
                      + sku        = {
                          + capacity = "[parameters('skuCapacity')]"
                          + family   = "[parameters('skuFamily')]"
                          + name     = "[parameters('skuName')]"
                          + size     = "[parameters('skuSizeMB')]"
                          + tier     = "[parameters('skuTier')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  + {
                      + apiVersion = "2017-12-01-preview"
                      + copy       = {
                          + count = "[length(variables('dbRules'))]"
                          + name  = "storagecopy"
                        }
                      + dependsOn  = [
                          + "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      + location   = "[parameters('location')]"
                      + name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      + properties = {
                          + ignoreMissingVnetServiceEndpoint = true
                          + virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      + type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              + variables      = {
                  + dbRules = "[base64ToJson(parameters('dbRules'))]"
                  + tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.db-rd-location-ref-api.null_resource.set-user-permissions[0] will be created
  + resource "null_resource" "set-user-permissions" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "rd-location-ref-api-postgres-db"
          + "script_hash"    = "03f79db43eea0260e31fe3dc6925df25b0373bdeb9982b92bedf86dfd47d593a"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[0] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "cftaks-tf-aks00"
          + "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[1] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "cftaks-tf-aks01"
          + "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[2] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "ase"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[3] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "aks"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[4] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[5] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "jenkins-aks-agent"
          + "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[6] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-test-aks00"
          + "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[7] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-test-aks01"
          + "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[8] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-stg-aks00"
          + "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[9] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-stg-aks01"
          + "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[10] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "bastion-nonprod-vnet"
          + "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[11] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "idam-aat2-vnet"
          + "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[12] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-dev-aks00"
          + "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
        }
    }

  # module.db-rd-location-ref-api.null_resource.subnet_mappings[13] will be created
  + resource "null_resource" "subnet_mappings" {
      + id       = (known after apply)
      + triggers = {
          + "rule_name" = "shared-services-dev-aks01"
          + "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
        }
    }

  # module.db-rd-location-ref-api.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

  # module.db-rd-location-ref-api-v16.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be destroyed
  # (because key ["azure.extensions"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      - id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-location-ref-api-postgres-db-v16-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-location-ref-api-postgres-db-v16-aat/configurations/azure.extensions" -> null
      - name      = "azure.extensions" -> null
      - server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-location-ref-api-postgres-db-v16-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-location-ref-api-postgres-db-v16-aat" -> null
      - value     = "PLPGSQL" -> null
    }

  # module.db-rd-location-ref-api-v16.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
        id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-location-ref-api-postgres-db-v16-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rd-location-ref-api-postgres-db-v16-aat/configurations/backslash_quote"
        name      = "backslash_quote"
      ~ value     = "ON" -> "on"
        # (1 unchanged attribute hidden)
    }

  # module.db-rd-location-ref-api-v16.null_resource.set-user-permissions-additionaldbs["dbrdlocationref"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "122818414639493327" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "force_trigger"  = "3" -> "1"
            # (3 unchanged elements hidden)
        }
    }

Plan: 40 to add, 4 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":707,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->